INSERT INTO position (name) VALUES ('сотрудник'), ('руководитель');

INSERT INTO employee (name, position_id)
VALUES ('Иван Иванов', 1), ('Петр Петров', 1), ('Сидор Сидоров', 2);

INSERT INTO device (name, verification_expire, taken, employee_id)
VALUES ('линейка', '2023-05-16 15:36:38', true, 1),
       ('штангенциркуль', '2020-03-11 12:00:00', true, 2),
       ('транспортир', '2022-06-10 15:00:00', true, 1),
       ('шумомер', '2023-05-11 14:00:00', true, 1);

INSERT INTO device_movement (taken, returned, device_id, employee_id)
VALUES ('2021-01-09 12:00:00', '2021-01-09 17:00:00', 1, 1),
       ('2021-01-09 12:00:00', '2021-01-09 17:00:00', 3, 1),
       ('2021-02-01 09:00:00', '2021-02-01 17:00:00', 1, 1),
       ('2021-03-04 10:00:00', '2021-03-04 16:00:00', 4, 3),
       ('2021-03-07 10:00:00', null, 1, 1),
       ('2021-03-07 10:00:00', null, 3, 1),
       ('2021-03-07 10:00:00', null, 4, 1),
       ('2021-03-07 10:00:00', null, 3, 2)
